other_pages/2.ejercicio/precipitaciones.html
---
layout: ejercicios
title: Ejercicio de Precipitaciones
---
<div id="content" class="content">
<div id="outline-container-org4bab15f" class="outline-2">
<h2 id="org4bab15f"><span class="section-number-2">1.</span> Ejercicios Clase 2</h2>
</div>

<div id="outline-container-org361baff" class="outline-2">
<h2 id="org361baff"><span class="section-number-2">2.</span> 70.26 - Hidráulica Agrícola y Saneamiento</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb6e7fc6" class="outline-3">
<h3 id="orgb6e7fc6"><span class="section-number-3">2.1.</span> Práctico N°2: Precipitación Media Areal</h3>
<div class="outline-text-3" id="text-2-1">
<p>
En esta práctica utilizaremos los
<a href="./DatosTp.zip">datos que se pueden descargar aquí</a>
</p>

<p>
Los mismos constan de una planilla de estaciones y otra de mediciones
para cada proveedor de datos (INTA y SMN).
</p>

<p>
Para el trabajo deben elegir una zona y un período de tiempo, y calcular
la lluvia acumulada en ese período para las estaciones dentro de la
zona. Sobre estos datos resumidos contruirán las planillas de trabajo,
agregando la información de posición de la estación.
</p>

<p>
Si eligen un período de datos donde haya datos tanto de INTA como SMN es
muy interesante que puedan realizar el cálculo por separado y comparar
el resultado. Caso contrario, pueden evaluar cómo afecta al resultado
final incluir todas o solo algunas de las estaciones disponibles. Este
tipo de procedimientos en estadística se conocen como validación cruzada
y son importantes para verificar la coherencia interna de los datos
analizados.
</p>

<p>
Para elegir la zona de trabajo, les recomendamos elegir alguna cuenca
hidrográfica basándose en los datos que pueden descargarse
<a href="https://hydrosheds.org/downloads">en esta pagina</a> , en la parte que
dice "HydroBasins". Una cuenca del dataset de 3er o de 4to nivel puede
ser una área razonable para el ejercicio propuesto.
</p>
</div>

<div id="outline-container-org9743880" class="outline-4">
<h4 id="org9743880"><span class="section-number-4">2.1.1.</span> PROBLEMA 1: Utilizar datos sólo de precipitación.</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>Hallar la precipitación media areal en la zona elegida con los datos
pluviométricos que se indican en la Tabla utilizando los siguientes
métodos:
<ol class="org-ol">
<li>Precipitación Media Aritmética</li>
<li>Polígonos de Thiessen (vecino más cercano)</li>
<li>Triangulación</li>
<li>Isoyetas (Kriging - Mínima Curvatura)</li>
</ol></li>
<li>Efectuar un análisis comparativo de los 4 métodos, explicando
brevemente las características de cada uno y sus diferencias.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org79698fb" class="outline-3">
<h3 id="org79698fb"><span class="section-number-3">2.2.</span> Ir un paso mas lejos.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
El método de isoyetas normalmente incluye aprovechar la información del
terreno para interpolar las isoyetas. Tradicionalmente este proceso se
hacía en forma manual, dibujando las isoyetas sobre un plano de curvas
de nivel.
</p>

<p>
La idea detrás de esto es que la información de altura del terreno está
correlacionada con la información de precipitaciones, y en consecuencia
es correcto utilizar la variable altura como una ayuda a la regresión de
los valores de precipitación.
</p>

<p>
Para hacer este proceso en forma automatizada existen varios métodos.
Entre los más conocidos se encuentran el llamado "CoKriging" y el de
"Regression Krigging".
</p>
</div>

<div id="outline-container-orga5920fd" class="outline-4">
<h4 id="orga5920fd"><span class="section-number-4">2.2.1.</span> PROBLEMA 2: Agregar la variable altura.</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>Investigue sobre los posibles métodos automatizados para la
interpolación de los datos pluviométricos teniendo en cuenta la
información de altura y descríbalos muy brevemente.</li>

<li>Descargue un modelo de terreno adecuado para la zona de estudio
(SRTM, PALSAR, ASTER, etc). Tenga en cuenta que las coordenadas
provistas corresponden a valores de Gauss Kruger en Kilómetros. Puede
utilizar los datos de altura y cartografía del IGN que están
disponibles en el <a href="http://mapa.ign.gob.ar/">sitio del instituto</a></li>

<li>Aplique uno de los métodos propuestos y analice el resultado
obtenido, indique los problemas que encuentra. No es necesario que el
resultado sea perfecto, buscamos que se analice las dificultades y
ventajas de los métodos.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgc83c7d0" class="outline-3">
<h3 id="orgc83c7d0"><span class="section-number-3">2.3.</span> Recursos</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Para realizar el cálculo, en todos los casos se deberá trabajar con
datos raster, generados a partir de los datos pluviométricos y cortados
con la máscara del área de estudio.
</p>

<p>
Para realizar esto pueden utilizar el software de su preferencia.
Recomendamos considerar el uso de software libre, de modo que su trabajo
sea accesible y pueda compartirse sin conflictos.
</p>

<p>
Para realizar el método de Polígonos de Thissen, cada polígono de
influencia corresponde al área donde el pluviómetro mas cercano es el
analizado. para lograr esto se puede generar una grilla utilizando el
método de interpolación de "Vecino más cercano".
</p>

<p>
El Método de triangulación implica hacer una interpolación lineal por
red de triángulos irregulares (TIN).
</p>

<p>
Estos dos métodos están disponibles en la mayoría del software gis. Por
ejemplo <a href="https://qgis.org/en/site/">Qgis</a>,
<a href="https://grass.osgeo.org/">Grass</a> o
<a href="https://live.osgeo.org/es/overview/saga_overview.html">SAGA<sub>GIS</sub></a>
(Link para descarga:
<a href="https://sourceforge.net/projects/saga-gis/files/SAGA%20-%207/SAGA%20-%207.6.2/">SAGA<sub>GIS</sub></a>),
o la herramienta por línea de comandos
<a href="https://www.generic-mapping-tools.org/">GMT</a>.
</p>

<p>
También pueden utilizar algún lenguaje de programación especializado
domo R, o incluso Python, que cuentan con módulos para realizar este
tipo de análisis. Para utilizar R recomendamos usar
<a href="https://rstudio.com/products/rstudio/download/#download">RStudio</a>. Es
muy interesante poder trabajar con este lenguaje, por eso no queremos
dejar de mencionarlo. Hay gran cantidad de material y tutoriales en
internet que se pueden encontrar a través de cualquier buscador.
</p>

<p>
En cuanto al método de Isoyetas, proponemos que como primera
aproximación las generen utilizando el método de interpolación de
Kriging. Este método está disponible en SAGA<sub>GIS</sub>, y a través de este,
en QGIS. Recomendamos utilizar SAGA<sub>GIS</sub> directamente, porque permite
el acceso a más información sobre el proceso que se realiza. A
continuación les acerco un pequeño video tutorial sobre esto:
</p>

<p>
También utilizando el lenguaje R se puede aplicar el método de krigging,
les dejamos algunos recursos útiles en caso de que decidan utilizar este
software. <a href="https://rpubs.com/nabilabd/118172">Link 1</a>,
<a href="http://rstudio-pubs-static.s3.amazonaws.com/80464_9156596afb2e4dcda53e3650a68df82a.html">Link
2</a>, <a href="https://rspatial.org/raster/analysis/4-interpolation.html">Link
3</a>
</p>

<p>
En el caso de los metodos de CoKrigging y Regression Krigging,
propuestos en el segundo ejercicio, SAGA<sub>GIS</sub> dispone de este último, y
ambos están disponibles para utilizar en el lenguaje R.
</p>

<p>
Un recurso muy completo sobre estos métodos, aplicado a variables
ambientales y con referencia a uso de software, es el siguiente
<a href="https://www.lu.lv/materiali/biblioteka/es/pilnieteksti/vide/A%20Practical%20Guide%20to%20Geostatistical%20Mapping%20of%20Environmental%20Variables.pdf">Link</a>,
de el extrajimos una pequeña sección sobre krigging, que nos propone
aprender la metodología a partir de un <a href="./EZ-kriging.zip">sencillo
aplicativo que puede descargar aqui junto con el pdf del extracto</a>
</p>

<p>
También les incluimos un breve documento en castellano sobre
<a href="./Como_funciona_krigging.pdf">cómo funciona kriging</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-22 sáb 14:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
